# Common
tap "homebrew/bundle"
tap "zackelia/formulae"

brew "autoconf"
brew "coreutils"
brew "asdf"
brew "awscli"
brew "bat"
brew "broot"
brew "chezmoi"
brew "colima"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "fd"
brew "fnt"
brew "fzf"
brew "git-delta"
brew "htop"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "p7zip"
brew "pgcli"
brew "poetry"
brew "ripgrep"
brew "vim"
brew "wget"
brew "wxwidgets"
brew "zackelia/formulae/bclm"

cask "karabiner-elements"
cask "kitty"
cask "slack"
cask "sublime-text"
cask "zoom"
{{- if .isPersonal }}

# Extra - packages for personal machines
tap "nextdns/tap"

brew "croc"
brew "nextdns/tap/nextdns"

cask "android-file-transfer"
cask "android-platform-tools"
cask "autofirma"
cask "chronycontrol"
cask "maccy"
cask "macfuse"
cask "mos"
cask "mullvadvpn"
cask "sanesidebuttons"
{{- end }}
